"""Постройки"""

from collections import namedtuple
from client_dir.settings import LD, EM, UH, MC

Building = namedtuple('Building', ['bname', 'unit_name', 'cost', 'coords'])

guild = Building('Гильдия', '', 150, [480, 30, 118, 114])
magic_guild = Building('Башня магии', '', 300, [480, 287, 118, 114])
temple = Building('Храм', '', 150, [480, 555, 118, 114])

BRANCHES = {
    'fighter': 0,
    'archer': 1,
    'mage': 2,
    'support': 3,
    'special': 4
}

FACTIONS = {
    EM: {
        'others': {
            1: guild,
            2: magic_guild,
            3: temple,
        },
        'fighter': {
            1: Building('Конюшня', 'Рыцарь', 200, [319, 32, 118, 114]),
            2: Building('Конюшня Империи', 'Имперский рыцарь', 500, [320, 259, 118, 114]),
            3: Building('Алтарь', 'Паладин', 1500, [424, 499, 118, 114]),
            4: Building('Священная Статуя', 'Священный мститель', 3000, [296, 745, 118, 114]),
            5: Building('Часовня', 'Защитник Веры', 3000, [554, 745, 118, 114]),
            6: Building('Фонтан Жизни', 'Ангел', 1500, [236, 499, 118, 114]),
            7: Building('Подземелье', 'Охотник на ведьм', 200, [646, 33, 118, 114]),
            8: Building('Камера пыток', 'Инквизитор', 500, [646, 260, 118, 114]),
            9: Building('Магистрат', 'Великий инквизитор', 1500, [646, 500, 118, 114]),
        },
        'archer': {
            1: Building('Стрельбище', 'Стрелок', 200, [440, 32, 118, 114]),
            2: Building('Гильдия Империи', 'Имперский ассасин', 500, [441, 259, 118, 114]),
        },
        'mage': {
            1: Building('Библиотека', 'Маг', 200, [329, 32, 118, 114]),
            2: Building('Башня', 'Волшебник', 500, [236, 298, 118, 114]),
            3: Building('Башня таинств', 'Белый волшебник', 1500, [236, 540, 118, 114]),
            4: Building('Круг Стихий', 'Элементалист', 500, [435, 298, 118, 114]),
        },
        'support': {
            1: Building('Монастырь', 'Жрец', 200, [329, 32, 118, 114]),
            2: Building('Святилище', 'Имперский жрец', 500, [330, 259, 118, 114]),
            3: Building('Молельня', 'Иерофант', 1500, [330, 502, 118, 114]),
            4: Building('Церковь', 'Клирик', 200, [596, 33, 118, 114]),
            5: Building('Собор', 'Матриарх', 500, [596, 260, 118, 114]),
            6: Building('Базилика', 'Прорицательница', 1500, [596, 502, 118, 114]),
        },
        'special': {
            1: Building('Разрушенный храм', 'Титан', 750, []),
        }
    },
    UH: {
        'others': {
            1: guild,
            2: magic_guild,
            3: temple,
        },
        'fighter': {
            1: Building('Нечистая земля', 'Зомби', 200, [321, 33, 119, 114]),
            2: Building('Кладбище', 'Скелет-воин', 500, [322, 277, 118, 114]),
            3: Building('Убежище духов', 'Скелет-чемпион', 1500, [322, 511, 118, 114]),
            4: Building('Крематорий', 'Воин-фантом', 3000, [322, 747, 118, 115]),
            5: Building('Капище', 'Храмовник', 200, [590, 33, 118, 114]),
            6: Building('Идол Тьмы', 'Тёмный властелин', 500, [590, 278, 118, 114]),
        },
        'archer': {
            1: Building('Гробница', 'Призрак', 200, [480, 30, 118, 114]),
            2: Building('Катакомбы', 'Тень', 1000, [480, 306, 118, 116]),
        },
        'mage': {
            1: Building('Храм Тьмы', 'Чернокнижник', 200, [470, 33, 118, 114]),
            2: Building('Оскверненный храм', 'Некромант', 500, [340, 257, 118, 114]),
            3: Building('Склеп', 'Вампир', 1500, [222, 504, 118, 114]),
            4: Building('Цитадель', 'Старший вампир', 3000, [222, 747, 118, 114]),
            5: Building('Башня тьмы', 'Лич', 1500, [380, 504, 118, 114]),
            6: Building('Башня колдовства', 'Архилич', 3000, [380, 747, 118, 114]),
            7: Building('Часовня проклятых', 'Умертвие', 620, [595, 257, 118, 114]),
            8: Building('Обитель Мортис', 'Смерть', 1875, [537, 504, 118, 114]),
            9: Building('Обитель душ', 'Сущий', 2250, [697, 504, 118, 116]),
        },
        'support': {
            1: Building('Пещера', 'Дрейк Рока', 300, [373, 33, 118, 114]),
            2: Building('Кладбище', 'Дракон Смерти', 750, [373, 274, 118, 114]),
            3: Building('Проклятое кладбище', 'Вирм Ужаса', 2250, [250, 534, 118, 114]),
            4: Building('Драконье кладбище', 'Драколич', 2250, [497, 534, 118, 114]),
        },
        'special': {
            1: Building('Логово оборотней', 'Оборотень', 750, []),
        }
    },
    LD: {
        'others': {
            1: guild,
            2: magic_guild,
            3: temple,
        },
        'fighter': {
            1: Building('Портал Скверны', 'Берсерк', 200, [339, 33, 118, 114]),
            2: Building('Башня Духов', 'Антипаладин', 500, [339, 285, 118, 114]),
            3: Building('Идол Бетрезена', 'Адский рыцарь', 1500, [339, 553, 118, 114]),
        },
        'archer': {
            1: Building('Шпиль', 'Мраморная гаргулья', 300, [478, 33, 118, 114]),
            2: Building('Черный шпиль', 'Ониксовая гаргулья', 750, [478, 309, 118, 114]),
        },
        'mage': {
            1: Building('Аббатство Тьмы', 'Чародей', 200, [338, 32, 118, 114]),
            2: Building('Темное Святилище', 'Демонолог', 500, [441, 258, 118, 114]),
            3: Building('Алтарь', 'Пандемонеус', 1500, [441, 528, 118, 114]),
            4: Building('Священный алтарь', 'Модеус', 3000, [441, 747, 118, 114]),
            5: Building('Замок духов', 500, 'Доппельгангер', [238, 258, 118, 114]),
            6: Building('Чертог Обмана', 'Инкуб', 1500, [238, 528, 118, 114]),
            7: Building('Дворец Пороков', 'Ведьма', 200, [660, 33, 118, 114]),
            8: Building('Дворец Греха', 'Колдунья', 500, [660, 260, 118, 114]),
            9: Building('Высший храм', 'Суккуб', 1500, [660, 528, 118, 114]),
        },
        'support': {
            1: Building('Врата Скверны', 'Демон', 300, [439, 33, 118, 114]),
            2: Building('Часовня Мучений', 'Молох', 750, [439, 260, 118, 114]),
            3: Building('Алтарь Скверны', 'Зверь', 2550, [250, 477, 118, 114]),
            4: Building('Темница', 'Тиамат', 4500, [250, 695, 118, 114]),
            5: Building('Адские Врата', 'Повелитель демонов', 2250, [580, 477, 118, 114]),
            6: Building('Чертоги Скверны', 'Владыка', 4500, [476, 695, 118, 114]),
            7: Building('Мавзолей', 'Дьявол Бездны', 4500, [668, 695, 118, 114]),
        },
        'special': {
            1: Building('Храм Горестей', 'Изверг', 750, []),
        }
    },
    MC: {
        'others': {
            1: guild,
            2: magic_guild,
            3: temple,
        },
        'fighter': {
            1: Building('Пивоварня', 'Воин', 200, [455, 29, 118, 114]),
            2: Building('Арсенал', 'Ветеран', 500, [282, 258, 118, 114]),
            3: Building('Храм Предков', 'Почтенный воин', 1500, [282, 507, 118, 114]),
            4: Building('Дворец', 'Король гномов', 4500, [220, 744, 118, 114]),
            5: Building('Рунный Зал', 'Мастер рун', 3000, [424, 744, 118, 114]),
            6: Building('Застава', 'Горец', 500, [607, 258, 118, 114]),
            7: Building('Берлога', 'Отшельник', 1500, [499, 507, 118, 114]),
            8: Building('Зал Фенрира', 'Повелитель волков', 1500, [693, 507, 118, 114]),
        },
        'archer': {
            1: Building('Стрельбище', 'Арбалетчик', 200, [464, 29, 118, 114]),
            2: Building('Горн Предков', 'Хранитель кузни', 500, [288, 256, 118, 115]),
            3: Building('Гильдия', 'Заклинатель огня', 700, [629, 256, 118, 115]),
        },
        'mage': {
            1: Building('Хижина', 'Новичок', 200, [341, 31, 118, 114]),
            2: Building('Сад Мудрости', 'Друид', 500, [235, 307, 118, 114]),
            3: Building('Древо Старейшин', 'Архидруид', 1500, [234, 568, 118, 114]),
            4: Building('Башня алхимии', 'Алхимик', 500, [443, 307, 118, 114]),
        },
        'support': {
            1: Building('Горный пик', 'Горный гигант', 300, [464, 32, 118, 114]),
            2: Building('Небесный замок', 'Штормовой гигант', 750, [287, 258, 118, 114]),
            3: Building('Мост Бифрост', 'Старейший', 2250, [282, 505, 118, 114]),
            4: Building('Снежные горы', 'Ледяной гигант', 750, [630, 258, 118, 114]),
            5: Building('Ледяные пещеры', 'Сын Имира', 2250, [630, 505, 120, 114]),
        },
        'special': {
            1: Building('Горное логово', 'Йети', 750, []),
        }
    }
}
