# Постройки Легионов Проклятых
from client_dir.settings import LD

legion_fighters = {
    1: ['Портал Скверны', 'Берсерк'],
    2: ['Башня Духов', 'Антипаладин'],
    3: ['Идол Бетрезена', 'Адский рыцарь'],
}

factions = {
    LD: {
        'fighter': {
            1: ['Портал Скверны', 'Берсерк'],
            2: ['Башня Духов', 'Антипаладин'],
            3: ['Идол Бетрезена', 'Адский рыцарь'],
        },
        'archer': {
            1: ['Шпиль', 'Мраморная гаргулья'],
            2: ['Черный шпиль', 'Обсидиановая гаргулья'],
        }
    }
}
