# units ranking

empire_fighter_lvls = {
    1: 'Сквайр',
    2: 'Рыцарь',
    3: 'Имперский рыцарь',
    4: 'Паладин',
    5: 'Защитник веры',
}

empire_mage_lvls = {
    1: 'Ученик',
    2: 'Маг',
    3: 'Волшебник',
    4: 'Белый волшебник',
}

empire_archer_lvls = {
    1: 'Лучник',
    2: 'Стрелок',
    3: 'Имперский ассасин',
}

empire_support_lvls = {
    1: 'Послушник',
    2: 'Клирик',
    3: 'Матриарх',
    4: 'Прорицательница',
}

hordes_fighter_lvls = {
    1: 'Боец',
    2: 'Зомби',
    3: 'Скелет-воин',
    4: 'Скелет-чемпион',
    5: 'Воин-фантом',
}

hordes_mage_lvls = {
    1: 'Посвящённый',
    2: 'Чернокнижник',
    3: 'Некромант',
    4: 'Лич',
    5: 'Архилич',
}

hordes_archer_lvls = {
    1: 'Привидение',
    2: 'Призрак',
    3: 'Тень',
}

hordes_support_lvls = {
    1: 'Виверна',
    2: 'Дрейк Рока',
    3: 'Дракон Смерти',
    4: 'Драколич',
}

legions_fighter_lvls = {
    1: 'Одержимый',
    2: 'Берсерк',
    3: 'Антипаладин',
    4: 'Адский рыцарь',
}

legions_mage_lvls = {
    1: 'Сектант',
    2: 'Чародей',
    3: 'Демонолог',
    4: 'Пандемонеус',
    5: 'Архилич',
}

legions_archer_lvls = {
    1: 'Гаргулья',
    2: 'Мраморная гаргулья',
    3: 'Ониксовая гаргулья',
}

legions_support_lvls = {
    1: 'Чёрт',
    2: 'Демон',
    3: 'Молох',
    4: 'Повелитель демонов',
    5: 'Владыка',
}

clans_fighter_lvls = {
    1: 'Гном',
    2: 'Воин',
    3: 'Ветеран',
    4: 'Почтенный воин',
    5: 'Король гномов',
}

clans_mage_lvls = {
    1: 'Желторотик',
    2: 'Новичок',
    3: 'Друидесса',
    4: 'Архидруидесса',
}

clans_archer_lvls = {
    1: 'Метатель топоров',
    2: 'Арбалетчик',
    3: 'Хранитель кузни',
}

clans_support_lvls = {
    1: 'Холмовой гигант',
    2: 'Горный гигант',
    3: 'Ледяной гигант',
    4: 'Сын Имира',
}
